tylertms/dspic33e-sim/conformance/pwm.c
static void dead_time_cases(PwmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 15u, 7u, 0u);
    dspic33_write_word(cpu, 0x0c2au, 2u);
    dspic33_write_word(cpu, 0x0c2cu, 3u);
    enable_pwm(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "positive dead-time start");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "positive dead-time low start");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "positive dead-time high");
    dspic33_device_advance(cpu, 6u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "positive dead-time gap high");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "positive dead-time gap low");
    dspic33_device_advance(cpu, 3u);
    expect(state, dspic33_pwm_output(cpu, 0u, false), "positive dead-time low");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 15u, 7u, 0x0040u);
    dspic33_write_word(cpu, 0x0c2au, 2u);
    dspic33_write_word(cpu, 0x0c2cu, 3u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 6u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "negative dead-time high");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "negative dead-time overlap");
    dspic33_device_advance(cpu, 5u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "negative dead-time high end");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "negative dead-time low");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 15u, 7u, 0u);
    dspic33_write_word(cpu, 0x0c2au, 2u);
    dspic33_write_word(cpu, 0x0c2cu, 4u);
    enable_pwm(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "redundant dead-time start");
    expect(state, !dspic33_pwm_output(cpu, 0u, false),
           "redundant alternate dead-time start");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "redundant dead-time high");
    expect(state, !dspic33_pwm_output(cpu, 0u, false),
           "redundant alternate dead-time wait");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_pwm_output(cpu, 0u, false),
           "redundant alternate dead-time low");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0800u, 7u, 7u, 0u);
    dspic33_write_word(cpu, 0x0c2au, 1u);
    dspic33_write_word(cpu, 0x0c2cu, 2u);
    enable_pwm(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "push-pull dead-time start");
    dspic33_device_advance(cpu, 1u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "push-pull dead-time high");
    dspic33_device_advance(cpu, 7u);
    expect(state, !dspic33_pwm_output(cpu, 0u, false),
           "push-pull alternate dead-time start");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_pwm_output(cpu, 0u, false),
           "push-pull alternate dead-time low");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 15u, 3u, 0x0204u);
    dspic33_write_word(cpu, 0x0c28u, 8u);
    dspic33_write_word(cpu, 0x0c2au, 7u);
    dspic33_write_word(cpu, 0x0c2cu, 2u);
    enable_pwm(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "center dead-time high");
    dspic33_device_advance(cpu, 3u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "center dead-time gap high");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "center dead-time gap low");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_pwm_output(cpu, 0u, false), "center dead-time low");

    dspic33_reset(cpu, 0u);
    expect(state, dspic33_pwm_dead_time(cpu, 0u, false, 0u),
           "schedule subtract compensation");
    dspic33_device_advance(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 15u, 7u, 0x00c0u);
    dspic33_write_word(cpu, 0x0c2au, 2u);
    dspic33_write_word(cpu, 0x0c2cu, 1u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 8u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "subtract compensation shortens high");

    dspic33_reset(cpu, 0u);
    expect(state, dspic33_pwm_dead_time(cpu, 0u, true, 0u),
           "schedule add compensation");
    dspic33_device_advance(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 15u, 7u, 0x00c0u);
    dspic33_write_word(cpu, 0x0c2au, 2u);
    dspic33_write_word(cpu, 0x0c2cu, 1u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 8u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "add compensation lengthens high");

    dspic33_reset(cpu, 0u);
    dspic33_pwm_dead_time(cpu, 0u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 15u, 7u, 0x00e0u);
    dspic33_write_word(cpu, 0x0c2au, 2u);
    dspic33_write_word(cpu, 0x0c2cu, 1u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 8u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "compensation polarity inversion");
}

static void b1_dead_time_cases(PwmConformance* state, Dspic33* cpu) {
    uint8_t generator;
    for (generator = 0u; generator < DSPIC33_PWM_COUNT; generator++) {
        uint16_t address = base(generator);
        dspic33_reset(cpu, 0u);
        configure_generator(cpu, generator, 0u, 15u, 5u, 0x00c0u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0au), 3u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0cu), 1u);
        enable_pwm(cpu, 0u);
        expect(state, dspic33_pwm_output(cpu, generator, false),
               "B1 zero compensation bypasses alternate dead time");
        dspic33_device_advance(cpu, 1u);
        expect(state, !dspic33_pwm_output(cpu, generator, true),
               "B1 subtract compensation saturates below twice DTR");

        dspic33_reset(cpu, 0u);
        configure_generator(cpu, generator, 0u, 15u, 6u, 0x00c0u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0au), 3u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0cu), 1u);
        enable_pwm(cpu, 0u);
        dspic33_device_advance(cpu, 1u);
        expect(state, dspic33_pwm_output(cpu, generator, true),
               "B1 subtract compensation retains twice DTR boundary");

        dspic33_reset(cpu, 0u);
        expect(state, dspic33_pwm_dead_time(cpu, generator, true, 0u),
               "schedule B1 additive compensation");
        dspic33_device_advance(cpu, 0u);
        configure_generator(cpu, generator, 0u, 15u, 9u, 0x00c0u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0au), 3u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0cu), 1u);
        enable_pwm(cpu, 0u);
        expect(state, dspic33_pwm_output(cpu, generator, true),
               "B1 full compensation bypasses alternate dead time");
        dspic33_device_advance(cpu, 7u);
        expect(state, dspic33_pwm_output(cpu, generator, true),
               "B1 add compensation saturates at twice DTR boundary");

        dspic33_reset(cpu, 0u);
        configure_generator(cpu, generator, 0u, 15u, 2u, 0u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0au), 1u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0cu), 3u);
        enable_pwm(cpu, 0u);
        expect(state, dspic33_pwm_output(cpu, generator, true),
               "B1 short edge duty removes leading dead time");
        dspic33_device_advance(cpu, 3u);
        expect(state, dspic33_pwm_output(cpu, generator, false),
               "B1 short edge duty removes trailing dead time");

        dspic33_reset(cpu, 0u);
        configure_generator(cpu, generator, 0u, 15u, 7u, 0x02c4u);
        dspic33_write_word(cpu, (uint16_t)(address + 8u), 15u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0au), 0u);
        dspic33_write_word(cpu, (uint16_t)(address + 0x0cu), 4u);
        enable_pwm(cpu, 0u);
        dspic33_device_advance(cpu, 6u);
        expect(state, dspic33_pwm_output(cpu, generator, true),
               "B1 center compensation leaves high edge unchanged");
        dspic33_device_advance(cpu, 2u);
        expect(state, !dspic33_pwm_output(cpu, generator, false),
               "B1 center compensation extends low edge");
    }
}

